app/controllers/products_controller.rb

  def index
    CsvImporter.new(Rails.root.to_s + '/db/code_test_data.csv').read_from_csv!
    @products = Product.all
---
SELECT "products".* FROM "products"  WHERE (code LIKE '%t%')

  def create
    @product = Product.new(params[:product])

    if @product.save
---
INSERT INTO "products" ("code", "created_at", "updated_at") VALUES (?, ?, ?)  [["code", "MyString"], ["created_at", "2014-08-27 14:44:27.276632"], ["updated_at", "2014-08-27 14:44:27.276632"]]

  def update
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 980190962]]